In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data
from acquire import get_titanic_data, get_iris_data

Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?
> Do not rescale

In [2]:
from pydataset import data
df_iris = data('iris')

In [95]:
data('iris', show_doc=True)

iris

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Edgar Anderson's Iris Data

### Description

This famous (Fisher's or Anderson's) iris data set gives the measurements in
centimeters of the variables sepal length and width and petal length and
width, respectively, for 50 flowers from each of 3 species of iris. The
species are _Iris setosa_, _versicolor_, and _virginica_.

### Usage

    iris
    iris3

### Format

`iris` is a data frame with 150 cases (rows) and 5 variables (columns) named
`Sepal.Length`, `Sepal.Width`, `Petal.Length`, `Petal.Width`, and `Species`.

`iris3` gives the same data arranged as a 3-dimensional array of size 50 by 4
by 3, as represented by S-PLUS. The first dimension gives the case number
within the species subsample, the second the measurements with names `Sepal
L.`, `Sepal W.`, `Petal L.`, and `Petal W.`, and the third the species.

### Source

Fisher, R. A. (1936) The use of multiple measurements in taxonomic problems.
_Annals of Eugenics_, **7**, Part II, 179–188.

The data were collected by Anderson, Edgar (1935). The irises of the Gaspe
Peninsula, _Bulletin of the American Iris Society_, **59**, 2–5.

### References

Becker, R. A., Chambers, J. M. and Wilks, A. R. (1988) _The New S Language_.
Wadsworth & Brooks/Cole. (has `iris3` as `iris`.)

### See Also

`matplot` some examples of which use `iris`.

### Examples

    dni3 <- dimnames(iris3)
    ii <- data.frame(matrix(aperm(iris3, c(1,3,2)), ncol = 4,
                            dimnames = list(NULL, sub(" L.",".Length",
                                            sub(" W.",".Width", dni3[[2]])))),
        Species = gl(3, 50, labels = sub("S", "s", sub("V", "v", dni3[[3]]))))
    all.equal(ii, iris) # TRUE

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
df_iris.shape

(150, 5)

In [96]:
df_iris.columns.tolist()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [24]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [7]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [8]:
df_excel = pd.read_excel(io = 'Spreadsheets_Exercises_Solutions.xlsx', sheet_name = 'Table1_CustDetails')

In [9]:
df_excel_sample = df_excel.head(100)

In [10]:
df_excel.shape[0]

7049

In [88]:
pd.Series(df_excel.columns[0:5].tolist())

0          customer_id
1               gender
2    is_senior_citizen
3              partner
4           dependents
dtype: object

In [44]:
excel_dtypes = pd.DataFrame(df_excel.dtypes)
excel_dtypes[excel_dtypes[0] == 'object']

                   0
customer_id   object
gender        object
partner       object
dependents    object
payment_type  object
churn         object

In [80]:
excel_num = df_excel.describe().transpose()

In [83]:
excel_num['range'] = excel_num['max'] - excel_num['min']
excel_num

,count,mean,std,min,25%,50%,75%,max,range
is_senior_citizen,7049.0,0.162009,0.368485,0.00,0.0000,0.00,0.000,1.00,1.0
phone_service,7049.0,1.324585,0.642709,0.00,1.0000,1.00,2.000,2.00,2.0
internet_service,7049.0,1.222585,0.779068,0.00,1.0000,1.00,2.000,2.00,2.0
contract_type,7049.0,0.690878,0.833757,0.00,0.0000,0.00,1.000,2.00,2.0
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75,100.5
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80,8666.0

Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [57]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'   

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [58]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [59]:
df_google.shape

(891, 12)

In [60]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [62]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [63]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [91]:
df_google.Sex.unique()

array(['male', 'female'], dtype=object)

In [92]:
df_google.Sex.nunique()

2

In [93]:
def cat_uniques(df):
    for col in df:
        if df[col].dtype == 'O':
            print(col)
            print('-------------')
            print(df[col].value_counts(dropna=False))
            print('-------------')

In [94]:
cat_uniques(df_google)

Name
-------------
Hays, Mrs. Charles Melville (Clara Jennings Gregg)    1
Uruchurtu, Don. Manuel E                              1
Soholt, Mr. Peter Andreas Lauritz Andersen            1
Lewy, Mr. Ervin G                                     1
Betros, Mr. Tannous                                   1
                                                     ..
Hart, Mrs. Benjamin (Esther Ada Bloomfield)           1
Laleff, Mr. Kristo                                    1
Coleff, Mr. Peju                                      1
Hart, Mr. Benjamin                                    1
Rush, Mr. Alfred George John                          1
Name: Name, Length: 891, dtype: int64
-------------
Sex
-------------
male      577
female    314
Name: Sex, dtype: int64
-------------
Ticket
-------------
1601                 7
CA. 2343             7
347082               7
CA 2144              6
3101295              6
                    ..
334912               1
2677                 1
STON/O 2. 3101269    1
236171               1
363294               1
Name: Ticket, Length: 681, dtype: int64
-------------
Cabin
-------------
NaN                687
C23 C25 C27          4
G6                   4
B96 B98              4
D                    3
F33                  3
F2                   3
E101                 3
C22 C26              3
B57 B59 B63 B66      2
C93                  2
B51 B53 B55          2
C125                 2
D26                  2
D33                  2
B5                   2
B20                  2
C78                  2
C124                 2
E24                  2
F G73                2
C123                 2
D35                  2
E8                   2
B58 B60              2
C65                  2
C68                  2
C83                  2
C2                   2
D17                  2
C52                  2
B35                  2
B22                  2
B18                  2
B49                  2
C92                  2
B77                  2
E44                  2
E25                  2
C126                 2
D20                  2
E121                 2
E67                  2
E33                  2
B28                  2
D36                  2
F4                   2
C110                 1
C7                   1
C104                 1
B3                   1
C99                  1
B39                  1
A34                  1
D56                  1
B41                  1
C118                 1
A23                  1
A36                  1
C47                  1
B101                 1
B69                  1
D49                  1
E63                  1
C103                 1
E17                  1
F E69                1
C62 C64              1
E34                  1
E46                  1
B80                  1
E58                  1
E40                  1
D45                  1
B86                  1
C30                  1
C85                  1
A14                  1
D9                   1
C106                 1
E68                  1
C101                 1
F G63                1
E38                  1
D30                  1
C46                  1
B71                  1
A24                  1
T                    1
E50                  1
C91                  1
E36                  1
C90                  1
D11                  1
D46                  1
D6                   1
D47                  1
A10                  1
C70                  1
B79                  1
B42                  1
B38                  1
D19                  1
D7                   1
C148                 1
B37                  1
B4                   1
E31                  1
D15                  1
C54                  1
D37                  1
A16                  1
C95                  1
E77                  1
B50                  1
C86                  1
D21                  1
D10 D12              1
C49                  1
A7                   1
C87                  1
C45                  1
B102                 1
B19                  1
A20                  1
B78                  1
A6                   1
D50                  1
C82                  1
E49                  1
C128                 1
B73                  1
B94                  1
E12                  1
D28                  1
A32                  1
A19                  1
A5                   1
C111                 1
F38                  1
A26                  1
D48                  1
B82 B84              1
E10                  1
C32                  1
B30                  1
A31                  1
C50                  1
Name: Cabin, dtype: int64
-------------
Embarked
-------------
S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64
-------------

In [14]:
df_tit = get_titanic_data()

In [16]:
df_tit.sample(1)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
156,156,1,3,female,16.0,0,0,7.7333,Q,Third,None,Queenstown,1

In [17]:
df_ir = get_iris_data()

In [18]:
df_ir.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa